import matplotlib.pyplot as plt

# 迭代次數
iterations = [i for i in range(0, 50)]

# 錯誤值
losses = [1.585, 0.569, 0.555, 0.563, 0.783, 
          0.290, 0.182, 0.196, 0.398, 0.248, 
          0.560, 0.253, 0.399, 0.275, 0.312, 
          0.152, 0.135, 0.676, 0.158, 0.178, 
          0.466, 0.166, 0.103, 0.096, 0.180, 
          0.162, 0.142, 0.116, 0.100, 0.121, 
          0.089, 0.090, 0.093, 0.109, 0.075, 
          0.077, 0.071, 0.115, 0.078, 0.105, 
          0.076, 0.152, 0.084, 0.068, 0.068, 
          0.076, 0.068, 0.071, 0.066, 0.066]

plt.plot(iterations, losses)
plt.title('Iteration vs. Loss')
plt.xlabel('Iteration')
plt.ylabel('Loss')
plt.show()
